{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\bella\Desktop\식자경4-2\정보처리분석\log\20210922.log
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 Sep 2021, 09:30:47

{com}. use "C:\Users\bella\Desktop\식자경4-2\정보처리분석\★정보처리분석 데이터\STATA 기초적 이해와 활용\data6_3.dta", clear
{txt}(SOEP'97 (Kohler/Kreuter))

{com}. do "C:\Users\bella\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. /* 20210922 수업 */
. 
. de

{txt}Contains data from {res}C:\Users\bella\Desktop\식자경4-2\정보처리분석\★정보처리분석 데이터\STATA 기초적 이해와 활용\data6_3.dta
{txt}  obs:{res}         3,340                          SOEP'97 (Kohler/Kreuter)
{txt} vars:{res}            47                          16 Oct 2008 13:04
{txt} size:{res}       223,780                          (_dta has notes)
{txt}{hline}
              storage  display     value
variable name   type   format      label      variable label
{hline}
{p 0 48}{res}{bind:persnr         }{txt}{bind: long   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:  }{res}{res}Person ID{p_end}
{p 0 48}{bind:intnr          }{txt}{bind: long   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Interviewer ID{p_end}
{p 0 48}{bind:state          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:bul      }{bind:* }{res}{res}State (Bundesland 97){p_end}
{p 0 48}{bind:gender         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sex      }{bind:  }{res}{res}Gender{p_end}
{p 0 48}{bind:ybirth         }{txt}{bind: int    }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:  }{res}{res}Year of Birth (YYYY){p_end}
{p 0 48}{bind:ymove          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Year moved in place{p_end}
{p 0 48}{bind:ybuild         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:bauj     }{bind:* }{res}{res}Year house was build{p_end}
{p 0 48}{bind:hcond          }{txt}{bind: byte   }{bind:{txt}%23.0f     }{space 1}{bind:renov    }{bind:* }{res}{res}House condition (renovation or not){p_end}
{p 0 48}{bind:sqfeet         }{txt}{bind: float  }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Home size in sqft.{p_end}
{p 0 48}{bind:rooms          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Number of rooms (bigger than 18 sqft.){p_end}
{p 0 48}{bind:fseval         }{txt}{bind: byte   }{bind:{txt}%14.0f     }{space 1}{bind:wgurt    }{bind:* }{res}{res}Home size evaluation {p_end}
{p 0 48}{bind:kitchen        }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Kitchen yes/no{p_end}
{p 0 48}{bind:shower         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Bath/Shower yes/no{p_end}
{p 0 48}{bind:wc             }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Toilet yes/no{p_end}
{p 0 48}{bind:heating        }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Central Heating yes/no{p_end}
{p 0 48}{bind:cellar         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Cellar yes/no{p_end}
{p 0 48}{bind:balcony        }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Balcony oder terrace yes/no{p_end}
{p 0 48}{bind:garden         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Garden (yard) yes/no{p_end}
{p 0 48}{bind:phone          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Phone yes/no{p_end}
{p 0 48}{bind:renttype       }{txt}{bind: byte   }{bind:{txt}%11.0f     }{space 1}{bind:wohnst   }{bind:* }{res}{res}Status of living{p_end}
{p 0 48}{bind:rent           }{txt}{bind: int    }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Rent monthly{p_end}
{p 0 48}{bind:renteval       }{txt}{bind: byte   }{bind:{txt}%12.0f     }{space 1}{bind:mietur   }{bind:* }{res}{res}Evaluation of monthly rent{p_end}
{p 0 48}{bind:hhtype         }{txt}{bind: byte   }{bind:{txt}%26.0f     }{space 1}{bind:ntyphh1  }{bind:* }{res}{res}Type of household{p_end}
{p 0 48}{bind:htype          }{txt}{bind: byte   }{bind:{txt}%21.0f     }{space 1}{bind:htyp     }{bind:* }{res}{res}Type of house{p_end}
{p 0 48}{bind:area           }{txt}{bind: byte   }{bind:{txt}%16.0f     }{space 1}{bind:wum      }{bind:* }{res}{res}Neighborhodd{p_end}
{p 0 48}{bind:np11701        }{txt}{bind: byte   }{bind:{txt}%16.0f     }{space 1}{bind:zuf      }{bind:  }{res}{res}General life satisfaction{p_end}
{p 0 48}{bind:np0105         }{txt}{bind: byte   }{bind:{txt}%16.0f     }{space 1}{bind:zuf      }{bind:  }{res}{res}Satisfaction with living conditions{p_end}
{p 0 48}{bind:np9401         }{txt}{bind: byte   }{bind:{txt}%10.0f     }{space 1}{bind:pia      }{bind:  }{res}{res}Party identification - yes/no{p_end}
{p 0 48}{bind:np9402         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:pib      }{bind:  }{res}{res}Party identification - Party{p_end}
{p 0 48}{bind:np9403         }{txt}{bind: byte   }{bind:{txt}%11.0f     }{space 1}{bind:pic      }{bind:  }{res}{res}Party identification - intensity{p_end}
{p 0 48}{bind:np9501         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: general economic development{p_end}
{p 0 48}{bind:np9502         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: own economic development{p_end}
{p 0 48}{bind:np9503         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: enviroment{p_end}
{p 0 48}{bind:np9504         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: peace{p_end}
{p 0 48}{bind:np9506         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: crime{p_end}
{p 0 48}{bind:np9507         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: employment (stability){p_end}
{p 0 48}{bind:hhpos          }{txt}{bind: byte   }{bind:{txt}%17.0f     }{space 1}{bind:hst      }{bind:* }{res}{res}Position within the household 1997{p_end}
{p 0 48}{bind:hhsize         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Size of household 1997{p_end}
{p 0 48}{bind:marital        }{txt}{bind: byte   }{bind:{txt}%9.0f      }{space 1}{bind:fam      }{bind:* }{res}{res}Marital status 1997{p_end}
{p 0 48}{bind:edu            }{txt}{bind: byte   }{bind:{txt}%24.0f     }{space 1}{bind:bil      }{bind:* }{res}{res}Education (school) 1997{p_end}
{p 0 48}{bind:voc            }{txt}{bind: byte   }{bind:{txt}%35.0g     }{space 1}{bind:bbil     }{bind:* }{res}{res}Highest degree (vocational training/university) 1997{p_end}
{p 0 48}{bind:yedu           }{txt}{bind: double }{bind:{txt}%8.2f      }{space 1}{bind:         }{bind:  }{res}{res}Years of education 1997{p_end}
{p 0 48}{bind:emp            }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Employment status 1997{p_end}
{p 0 48}{bind:occ            }{txt}{bind: byte   }{bind:{txt}%9.0g      }{space 1}{bind:         }{bind:  }{res}{res}Occupational Status{p_end}
{p 0 48}{bind:hhinc          }{txt}{bind: int    }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Household income 1997 (monthly){p_end}
{p 0 48}{bind:income         }{txt}{bind: int    }{bind:{txt}%9.0g      }{space 1}{bind:         }{bind:* }{res}{res}Personal (work related) income before tax 1997 (monthly){p_end}
{p 0 48}{bind:egph           }{txt}{bind: byte   }{bind:{txt}%34.0g     }{space 1}{bind:egp      }{bind:  }{res}{res}EGP-Class (main financier of household 1997){p_end}
                                            {txt}* indicated variables have notes
{hline}
Sorted by:  

{com}. 
{txt}end of do-file

{com}. db xtile

. xtile income_4 = income, nquantiles(4)

. do "C:\Users\bella\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. /* 20210922 수업 */
. 
. de

{txt}Contains data from {res}C:\Users\bella\Desktop\식자경4-2\정보처리분석\★정보처리분석 데이터\STATA 기초적 이해와 활용\data6_3.dta
{txt}  obs:{res}         3,340                          SOEP'97 (Kohler/Kreuter)
{txt} vars:{res}            48                          16 Oct 2008 13:04
{txt} size:{res}       227,120                          (_dta has notes)
{txt}{hline}
              storage  display     value
variable name   type   format      label      variable label
{hline}
{p 0 48}{res}{bind:persnr         }{txt}{bind: long   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:  }{res}{res}Person ID{p_end}
{p 0 48}{bind:intnr          }{txt}{bind: long   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Interviewer ID{p_end}
{p 0 48}{bind:state          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:bul      }{bind:* }{res}{res}State (Bundesland 97){p_end}
{p 0 48}{bind:gender         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sex      }{bind:  }{res}{res}Gender{p_end}
{p 0 48}{bind:ybirth         }{txt}{bind: int    }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:  }{res}{res}Year of Birth (YYYY){p_end}
{p 0 48}{bind:ymove          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Year moved in place{p_end}
{p 0 48}{bind:ybuild         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:bauj     }{bind:* }{res}{res}Year house was build{p_end}
{p 0 48}{bind:hcond          }{txt}{bind: byte   }{bind:{txt}%23.0f     }{space 1}{bind:renov    }{bind:* }{res}{res}House condition (renovation or not){p_end}
{p 0 48}{bind:sqfeet         }{txt}{bind: float  }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Home size in sqft.{p_end}
{p 0 48}{bind:rooms          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Number of rooms (bigger than 18 sqft.){p_end}
{p 0 48}{bind:fseval         }{txt}{bind: byte   }{bind:{txt}%14.0f     }{space 1}{bind:wgurt    }{bind:* }{res}{res}Home size evaluation {p_end}
{p 0 48}{bind:kitchen        }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Kitchen yes/no{p_end}
{p 0 48}{bind:shower         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Bath/Shower yes/no{p_end}
{p 0 48}{bind:wc             }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Toilet yes/no{p_end}
{p 0 48}{bind:heating        }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Central Heating yes/no{p_end}
{p 0 48}{bind:cellar         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Cellar yes/no{p_end}
{p 0 48}{bind:balcony        }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Balcony oder terrace yes/no{p_end}
{p 0 48}{bind:garden         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Garden (yard) yes/no{p_end}
{p 0 48}{bind:phone          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Phone yes/no{p_end}
{p 0 48}{bind:renttype       }{txt}{bind: byte   }{bind:{txt}%11.0f     }{space 1}{bind:wohnst   }{bind:* }{res}{res}Status of living{p_end}
{p 0 48}{bind:rent           }{txt}{bind: int    }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Rent monthly{p_end}
{p 0 48}{bind:renteval       }{txt}{bind: byte   }{bind:{txt}%12.0f     }{space 1}{bind:mietur   }{bind:* }{res}{res}Evaluation of monthly rent{p_end}
{p 0 48}{bind:hhtype         }{txt}{bind: byte   }{bind:{txt}%26.0f     }{space 1}{bind:ntyphh1  }{bind:* }{res}{res}Type of household{p_end}
{p 0 48}{bind:htype          }{txt}{bind: byte   }{bind:{txt}%21.0f     }{space 1}{bind:htyp     }{bind:* }{res}{res}Type of house{p_end}
{p 0 48}{bind:area           }{txt}{bind: byte   }{bind:{txt}%16.0f     }{space 1}{bind:wum      }{bind:* }{res}{res}Neighborhodd{p_end}
{p 0 48}{bind:np11701        }{txt}{bind: byte   }{bind:{txt}%16.0f     }{space 1}{bind:zuf      }{bind:  }{res}{res}General life satisfaction{p_end}
{p 0 48}{bind:np0105         }{txt}{bind: byte   }{bind:{txt}%16.0f     }{space 1}{bind:zuf      }{bind:  }{res}{res}Satisfaction with living conditions{p_end}
{p 0 48}{bind:np9401         }{txt}{bind: byte   }{bind:{txt}%10.0f     }{space 1}{bind:pia      }{bind:  }{res}{res}Party identification - yes/no{p_end}
{p 0 48}{bind:np9402         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:pib      }{bind:  }{res}{res}Party identification - Party{p_end}
{p 0 48}{bind:np9403         }{txt}{bind: byte   }{bind:{txt}%11.0f     }{space 1}{bind:pic      }{bind:  }{res}{res}Party identification - intensity{p_end}
{p 0 48}{bind:np9501         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: general economic development{p_end}
{p 0 48}{bind:np9502         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: own economic development{p_end}
{p 0 48}{bind:np9503         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: enviroment{p_end}
{p 0 48}{bind:np9504         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: peace{p_end}
{p 0 48}{bind:np9506         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: crime{p_end}
{p 0 48}{bind:np9507         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: employment (stability){p_end}
{p 0 48}{bind:hhpos          }{txt}{bind: byte   }{bind:{txt}%17.0f     }{space 1}{bind:hst      }{bind:* }{res}{res}Position within the household 1997{p_end}
{p 0 48}{bind:hhsize         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Size of household 1997{p_end}
{p 0 48}{bind:marital        }{txt}{bind: byte   }{bind:{txt}%9.0f      }{space 1}{bind:fam      }{bind:* }{res}{res}Marital status 1997{p_end}
{p 0 48}{bind:edu            }{txt}{bind: byte   }{bind:{txt}%24.0f     }{space 1}{bind:bil      }{bind:* }{res}{res}Education (school) 1997{p_end}
{p 0 48}{bind:voc            }{txt}{bind: byte   }{bind:{txt}%35.0g     }{space 1}{bind:bbil     }{bind:* }{res}{res}Highest degree (vocational training/university) 1997{p_end}
{p 0 48}{bind:yedu           }{txt}{bind: double }{bind:{txt}%8.2f      }{space 1}{bind:         }{bind:  }{res}{res}Years of education 1997{p_end}
{p 0 48}{bind:emp            }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Employment status 1997{p_end}
{p 0 48}{bind:occ            }{txt}{bind: byte   }{bind:{txt}%9.0g      }{space 1}{bind:         }{bind:  }{res}{res}Occupational Status{p_end}
{p 0 48}{bind:hhinc          }{txt}{bind: int    }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Household income 1997 (monthly){p_end}
{p 0 48}{bind:income         }{txt}{bind: int    }{bind:{txt}%9.0g      }{space 1}{bind:         }{bind:* }{res}{res}Personal (work related) income before tax 1997 (monthly){p_end}
{p 0 48}{bind:egph           }{txt}{bind: byte   }{bind:{txt}%34.0g     }{space 1}{bind:egp      }{bind:  }{res}{res}EGP-Class (main financier of household 1997){p_end}
{p 0 48}{bind:income_4       }{txt}{bind: byte   }{bind:{txt}%8.0g      }{space 1}{bind:         }{bind:  }{res}{res}4 quantiles of income{p_end}
                                            {txt}* indicated variables have notes
{hline}
Sorted by:  
{res}     Note:  dataset has changed since last saved
{txt}
{com}. 
. db xtile
{txt}
{com}. 
. order income_4, after(income)
{txt}
{com}. 
{txt}end of do-file

{com}. db recode

. recode ybirth (min/1979=0)(1980/max=1), generate(ybirth1)
{txt}(3340 differences between ybirth and ybirth1)

{com}. do "C:\Users\bella\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. /* 20210922 수업 */
. 
. de

{txt}Contains data from {res}C:\Users\bella\Desktop\식자경4-2\정보처리분석\★정보처리분석 데이터\STATA 기초적 이해와 활용\data6_3.dta
{txt}  obs:{res}         3,340                          SOEP'97 (Kohler/Kreuter)
{txt} vars:{res}            49                          16 Oct 2008 13:04
{txt} size:{res}       233,800                          (_dta has notes)
{txt}{hline}
              storage  display     value
variable name   type   format      label      variable label
{hline}
{p 0 48}{res}{bind:persnr         }{txt}{bind: long   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:  }{res}{res}Person ID{p_end}
{p 0 48}{bind:intnr          }{txt}{bind: long   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Interviewer ID{p_end}
{p 0 48}{bind:state          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:bul      }{bind:* }{res}{res}State (Bundesland 97){p_end}
{p 0 48}{bind:gender         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sex      }{bind:  }{res}{res}Gender{p_end}
{p 0 48}{bind:ybirth         }{txt}{bind: int    }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:  }{res}{res}Year of Birth (YYYY){p_end}
{p 0 48}{bind:ymove          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Year moved in place{p_end}
{p 0 48}{bind:ybuild         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:bauj     }{bind:* }{res}{res}Year house was build{p_end}
{p 0 48}{bind:hcond          }{txt}{bind: byte   }{bind:{txt}%23.0f     }{space 1}{bind:renov    }{bind:* }{res}{res}House condition (renovation or not){p_end}
{p 0 48}{bind:sqfeet         }{txt}{bind: float  }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Home size in sqft.{p_end}
{p 0 48}{bind:rooms          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Number of rooms (bigger than 18 sqft.){p_end}
{p 0 48}{bind:fseval         }{txt}{bind: byte   }{bind:{txt}%14.0f     }{space 1}{bind:wgurt    }{bind:* }{res}{res}Home size evaluation {p_end}
{p 0 48}{bind:kitchen        }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Kitchen yes/no{p_end}
{p 0 48}{bind:shower         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Bath/Shower yes/no{p_end}
{p 0 48}{bind:wc             }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Toilet yes/no{p_end}
{p 0 48}{bind:heating        }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Central Heating yes/no{p_end}
{p 0 48}{bind:cellar         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Cellar yes/no{p_end}
{p 0 48}{bind:balcony        }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Balcony oder terrace yes/no{p_end}
{p 0 48}{bind:garden         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Garden (yard) yes/no{p_end}
{p 0 48}{bind:phone          }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:janein   }{bind:* }{res}{res}Phone yes/no{p_end}
{p 0 48}{bind:renttype       }{txt}{bind: byte   }{bind:{txt}%11.0f     }{space 1}{bind:wohnst   }{bind:* }{res}{res}Status of living{p_end}
{p 0 48}{bind:rent           }{txt}{bind: int    }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Rent monthly{p_end}
{p 0 48}{bind:renteval       }{txt}{bind: byte   }{bind:{txt}%12.0f     }{space 1}{bind:mietur   }{bind:* }{res}{res}Evaluation of monthly rent{p_end}
{p 0 48}{bind:hhtype         }{txt}{bind: byte   }{bind:{txt}%26.0f     }{space 1}{bind:ntyphh1  }{bind:* }{res}{res}Type of household{p_end}
{p 0 48}{bind:htype          }{txt}{bind: byte   }{bind:{txt}%21.0f     }{space 1}{bind:htyp     }{bind:* }{res}{res}Type of house{p_end}
{p 0 48}{bind:area           }{txt}{bind: byte   }{bind:{txt}%16.0f     }{space 1}{bind:wum      }{bind:* }{res}{res}Neighborhodd{p_end}
{p 0 48}{bind:np11701        }{txt}{bind: byte   }{bind:{txt}%16.0f     }{space 1}{bind:zuf      }{bind:  }{res}{res}General life satisfaction{p_end}
{p 0 48}{bind:np0105         }{txt}{bind: byte   }{bind:{txt}%16.0f     }{space 1}{bind:zuf      }{bind:  }{res}{res}Satisfaction with living conditions{p_end}
{p 0 48}{bind:np9401         }{txt}{bind: byte   }{bind:{txt}%10.0f     }{space 1}{bind:pia      }{bind:  }{res}{res}Party identification - yes/no{p_end}
{p 0 48}{bind:np9402         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:pib      }{bind:  }{res}{res}Party identification - Party{p_end}
{p 0 48}{bind:np9403         }{txt}{bind: byte   }{bind:{txt}%11.0f     }{space 1}{bind:pic      }{bind:  }{res}{res}Party identification - intensity{p_end}
{p 0 48}{bind:np9501         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: general economic development{p_end}
{p 0 48}{bind:np9502         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: own economic development{p_end}
{p 0 48}{bind:np9503         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: enviroment{p_end}
{p 0 48}{bind:np9504         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: peace{p_end}
{p 0 48}{bind:np9506         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: crime{p_end}
{p 0 48}{bind:np9507         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:sor      }{bind:  }{res}{res}Worry: employment (stability){p_end}
{p 0 48}{bind:hhpos          }{txt}{bind: byte   }{bind:{txt}%17.0f     }{space 1}{bind:hst      }{bind:* }{res}{res}Position within the household 1997{p_end}
{p 0 48}{bind:hhsize         }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Size of household 1997{p_end}
{p 0 48}{bind:marital        }{txt}{bind: byte   }{bind:{txt}%9.0f      }{space 1}{bind:fam      }{bind:* }{res}{res}Marital status 1997{p_end}
{p 0 48}{bind:edu            }{txt}{bind: byte   }{bind:{txt}%24.0f     }{space 1}{bind:bil      }{bind:* }{res}{res}Education (school) 1997{p_end}
{p 0 48}{bind:voc            }{txt}{bind: byte   }{bind:{txt}%35.0g     }{space 1}{bind:bbil     }{bind:* }{res}{res}Highest degree (vocational training/university) 1997{p_end}
{p 0 48}{bind:yedu           }{txt}{bind: double }{bind:{txt}%8.2f      }{space 1}{bind:         }{bind:  }{res}{res}Years of education 1997{p_end}
{p 0 48}{bind:emp            }{txt}{bind: byte   }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Employment status 1997{p_end}
{p 0 48}{bind:occ            }{txt}{bind: byte   }{bind:{txt}%9.0g      }{space 1}{bind:         }{bind:  }{res}{res}Occupational Status{p_end}
{p 0 48}{bind:hhinc          }{txt}{bind: int    }{bind:{txt}%8.0f      }{space 1}{bind:         }{bind:* }{res}{res}Household income 1997 (monthly){p_end}
{p 0 48}{bind:income         }{txt}{bind: int    }{bind:{txt}%9.0g      }{space 1}{bind:         }{bind:* }{res}{res}Personal (work related) income before tax 1997 (monthly){p_end}
{p 0 48}{bind:income_4       }{txt}{bind: byte   }{bind:{txt}%8.0g      }{space 1}{bind:         }{bind:  }{res}{res}4 quantiles of income{p_end}
{p 0 48}{bind:egph           }{txt}{bind: byte   }{bind:{txt}%34.0g     }{space 1}{bind:egp      }{bind:  }{res}{res}EGP-Class (main financier of household 1997){p_end}
{p 0 48}{bind:ybirth1        }{txt}{bind: int    }{bind:{txt}%9.0g      }{space 1}{bind:         }{bind:  }{res}{res}RECODE of ybirth (Year of Birth (YYYY)){p_end}
                                            {txt}* indicated variables have notes
{hline}
Sorted by:  
{res}     Note:  dataset has changed since last saved
{txt}
{com}. 
. /* 소득을 분위 별로 나누기 */
. db xtile
{txt}
{com}. 
. order income_4, after(income)
{txt}
{com}. /* income_4의 순서를 income 변수 뒤로, 옮긴다. */
. 
. db recode
{txt}
{com}. /* Variabeles, Required */
. (min/1979=0)(1980/max=1)
{err}unrecognized command:  ( invalid command name
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. db stack

. use "C:\Users\bella\Desktop\식자경4-2\정보처리분석\★정보처리분석 데이터\STATA 기초적 이해와 활용\data6_5.dta", clear

. db stack

. stack treat control, into(cure)
{txt}Warning:  data in memory will be lost.
         Press any key to continue, Ctrl-Break to abort.

{com}. use "C:\Users\bella\Desktop\식자경4-2\정보처리분석\★정보처리분석 데이터\STATA 기초적 이해와 활용\data6_6.dta", clear

. db stack

. stack hhid04 pid1 gender1 age1 hhid04 pid2  gender2 age2, group(2)
{txt}Warning:  data in memory will be lost.
         Press any key to continue, Ctrl-Break to abort.

{com}. do "C:\Users\bella\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. /* 20210922 수업 */
. 
. de

{txt}Contains data
  obs:{res}         9,696                          
{txt} vars:{res}             5                          
{txt} size:{res}       329,664                          
{txt}{hline}
              storage  display     value
variable name   type   format      label      variable label
{hline}
{p 0 48}{res}{bind:_stack         }{txt}{bind: int    }{bind:{txt}%8.0g      }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hhid04         }{txt}{bind: double }{bind:{txt}%10.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:pid1           }{txt}{bind: double }{bind:{txt}%10.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:gender1        }{txt}{bind: double }{bind:{txt}%10.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:age1           }{txt}{bind: double }{bind:{txt}%10.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by:  
{res}     Note:  dataset has changed since last saved
{txt}
{com}. 
. /* 소득을 분위 별로 나누기 */
. db xtile
{txt}
{com}. 
. order income_4, after(income)
{err}variable income_4 not found
{txt}{search r(111):r(111);}

end of do-file

{search r(111):r(111);}

{com}. drop _stack

. rename (hhid04, pid1, gender1, age1)(hhid, pid, gender, age)
{res}{err}3 new variable names invalid
{p 4 4 2}
You attempted to rename {bf:hhid04} to {bf:hhid,}
,
{bf:pid1} to {bf:pid,}{err}, ...
Those are
invalid Stata variable names.
{p_end}
{txt}{search r(198):r(198);}

{com}. rename (hhid04 pid1 gender1 age1)(hhid pid gender age)
{res}
{com}. de

{txt}Contains data
  obs:{res}         9,696                          
{txt} vars:{res}             4                          
{txt} size:{res}       310,272                          
{txt}{hline}
              storage  display     value
variable name   type   format      label      variable label
{hline}
{p 0 48}{res}{bind:hhid           }{txt}{bind: double }{bind:{txt}%10.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:pid            }{txt}{bind: double }{bind:{txt}%10.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:gender         }{txt}{bind: double }{bind:{txt}%10.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:age            }{txt}{bind: double }{bind:{txt}%10.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by:  
{res}     Note:  dataset has changed since last saved

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\bella\Desktop\식자경4-2\정보처리분석\log\20210922.log
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}23 Sep 2021, 09:44:47
{txt}{.-}
{smcl}
{txt}{sf}{ul off}